/**
 *
 * array শুরু হয় index দিয়ে
 * আর array এর ১ম index কে বলা হয় 0 index
 *
 *  array গণনায় ১ম সংখ্যাকে 0 index বলা হয়
 * এখানে
 *          0 index = 12,
 *          1 index  = 66 ,
 *          2 index = 83
 *
 *     ======================
 *
 *       ১ নাম্বার = 12,
 *       ২ নাম্বার  = 66,
 *       ৩ নাম্বার = 83,
 *       ৪ নাম্বার = 74
 *
 *     ======================
 *
 *       ১ম = 0 index
 *       ২য় = 1 index
 *       ৩য় = 2 index
 *       ৪র্থ = 3 index
 *       ৫ম  = 4 index
 *
 *
 *      ===================
 *
 *       ১ম স্থানের বসানো যেকোনো সংখ্যাকে index 0 বলা হয়
 *
 */

const numbers = [12, 66, 83, 74, 65, 96, 37, 28, 19];

// [২] বলতে array এর মধ্যেকার ২ নাম্বার index অর্থাৎ ৮৩ কে বোঝায়
console.log(numbers[2]);

// এভাবে চাইলে মান পরিবর্তন করা যায়
numbers[3] = 9999;
console.log(numbers[3]);
